Repository: sassongal/Kickabout
Catalog: lib/l10n/app_*.arb
Languages: he

# appName
source: Kattrick
he: קיקאדור

source: Welcome
he: ברוכים הבאים

source: Login
he: התחבר

source: Register
he: הרשם

source: Email
he: אימייל

source: Password
he: סיסמה

source: Name
he: שם

source: Phone Number
he: מספר טלפון

source: Home
he: בית

source: Players
he: שחקנים

source: Games
he: משחקים

source: Hubs
he: הובס

source: Create Game
he: צור משחק

source: Create Hub
he: צור הוב

source: Team Formation
he: יצירת קבוצות

source: Stats
he: סטטיסטיקות

source: Profile
he: פרופיל

source: Share
he: שתף

source: Save
he: שמור

source: Cancel
he: ביטול

source: Delete
he: מחק

source: Edit
he: ערוך

source: Loading...
he: טוען...

source: Error
he: שגיאה

source: Success
he: הצלחה

# locationPermissionError
source: Location permission denied
he: אין הרשאת מיקום

source: Please login
he: נא להתחבר

# guestsCannotCreateHubs
source: Guests cannot create hubs. Please login or register.
he: אורחים לא יכולים ליצור הובים. נא להתחבר או להירשם.

# hubCreatedSuccess
source: Hub created successfully!
he: ההוב נוצר בהצלחה!

# hubCreationError
source: Error creating hub
he: שגיאה ביצירת הוב

# hubCreationPermissionError
source: You do not have permission to create a hub.
he: אין לך הרשאה ליצור הוב.

source: Please re-login
he: נא להתחבר מחדש

# hubCreationErrorDetails
source: Error creating hub: {error}
he: שגיאה ביצירת הוב: {error}

# createHubTitle
source: Create Hub
he: צור הוב

# hubNameLabel
source: Hub Name
he: שם ההוב

# hubNameHint
source: Enter hub name
he: הכנס שם להוב

# hubNameValidator
source: Please enter a name
he: נא להכניס שם

# hubDescriptionLabel
source: Description (Optional)
he: תיאור (אופציונלי)

# hubDescriptionHint
source: Enter hub description
he: הכנס תיאור להוב

# regionLabel
source: Region
he: אזור

# regionHint
source: Select region
he: בחר אזור

# regionHelperText
source: Affects regional feed
he: משפיע על הפיד האזורי

# regionNorth
source: North
he: צפון

# regionCenter
source: Center
he: מרכז

# regionSouth
source: South
he: דרום

# regionJerusalem
source: Jerusalem
he: ירושלים

# venuesOptionalLabel
source: Venues (Optional)
he: מגרשים (אופציונלי)

# venuesAddLaterInfo
source: You can add venues later in hub settings
he: תוכל להוסיף מגרשים מאוחר יותר בהגדרות ההוב

# venuesAddAfterCreationInfo
source: You can add venues after creating the hub
he: תוכל להוסיף מגרשים לאחר יצירת ההוב

# addVenuesButton
source: Add Venues
he: הוסף מגרשים

# locationOptionalLabel
source: Location (Optional)
he: מיקום (אופציונלי)

source: Getting location...
he: מקבל מיקום...

source: Current Location
he: מיקום נוכחי

source: Select on Map
he: בחר במפה

source: Creating...
he: יוצר...

source: Error: Missing Hub ID
he: שגיאה: מזהה הוב חסר

source: Event not found
he: אירוע לא נמצא

source: Game not found
he: משחק לא נמצא

# noAdminPermissionForScreen
source: You do not have admin permission for this screen
he: אין לך הרשאת ניהול למסך זה

source: Only Hub admins can create teams
he: רק מנהלי הוב יכולים ליצור קבוצות

source: Not enough registered players
he: אין מספיק נרשמים

# requiredPlayersCount
source: At least {count} players are required
he: נדרשים לפחות {count} שחקנים

# registeredPlayerCount
source: Registered: {count}
he: נרשמו: {count}

# permissionCheckErrorDetails
source: Permission check error: {error}
he: שגיאה בבדיקת הרשאות: {error}

# hubSettingsTitle
source: Hub Settings
he: הגדרות הוב

source: Loading settings...
he: טוען הגדרות...

source: Hub not found
he: הוב לא נמצא

source: Try Again
he: נסה שוב

source: Rating Mode
he: מצב דירוג

# advancedRating
source: Advanced
he: מתקדם

# basicRating
source: Basic
he: בסיסי

# basicRatingDescription
source: Simple 1-10 rating
he: דירוג פשוט 1-10

# advancedRatingDescription
source: Detailed attributes (Pace, Shooting, etc.)
he: תכונות מפורטות (מהירות, בעיטה וכו')

# privacySettings
source: Privacy
he: פרטיות

# privateHub
source: Private
he: פרטי

# publicHub
source: Public
he: ציבורי

# publicHubDescription
source: Visible to everyone
he: גלוי לכולם

# privateHubDescription
source: Invite only
he: הזמנה בלבד

source: Join Mode
he: מצב הצטרפות

source: Approval Required
he: נדרש אישור

source: Auto Join
he: הצטרפות אוטומטית

# autoJoinDescription
source: Anyone can join instantly
he: כל אחד יכול להצטרף מיידית

# approvalRequiredDescription
source: Admins must approve requests
he: מנהלים חייבים לאשר בקשות

source: Notifications
he: התראות

# notificationsDescription
source: Enable hub notifications
he: אפשר התראות הוב

source: Hub Chat
he: צ'אט הוב

# hubChatDescription
source: Enable chat for members
he: אפשר צ'אט לחברים

source: Activity Feed
he: פיד פעילות

# activityFeedDescription
source: Show member activity
he: הצג פעילות חברים

source: Manage Venues
he: ניהול מגרשים

# manageVenuesDescription
source: Add or remove playing venues
he: הוסף או הסר מגרשי משחק

source: Hub Rules
he: חוקי ההוב

# characterCount
source: {count} characters
he: {count} תווים

source: No rules defined
he: לא הוגדרו חוקים

# paymentLinkLabel
source: Payment Link
he: קישור לתשלום

source: Defined
he: מוגדר

source: Not defined
he: לא מוגדר

# hubInvitations
source: Invitations
he: הזמנות

# hubInvitationsDescription
source: Manage pending invitations
he: ניהול הזמנות ממתינות

source: Checking permissions...
he: בודק הרשאות...

source: Permission check error
he: שגיאה בבדיקת הרשאות

# settingUpdatedSuccess
source: Setting updated successfully
he: הגדרה עודכנה בהצלחה

# settingUpdateError
source: Error updating setting: {error}
he: שגיאה בעדכון הגדרה: {error}

# hubRulesSavedSuccess
source: Rules saved successfully
he: חוקים נשמרו בהצלחה

# hubRulesSaveError
source: Error saving rules: {error}
he: שגיאה בשמירת חוקים: {error}

# hubRulesHint
source: Enter hub rules here...
he: הכנס חוקי הוב כאן...

# hubRulesHelper
source: Visible to all members
he: גלוי לכל החברים

source: Saving...
he: שומר...

source: Save Rules
he: שמור חוקים

# paymentLinkSavedSuccess
source: Payment link saved
he: קישור לתשלום נשמר

# paymentLinkSaveError
source: Error saving link: {error}
he: שגיאה בשמירת קישור: {error}

# paymentLinkBitLabel
source: Payment Link (Bit/PayBox)
he: קישור לתשלום (ביט/פייבוקס)

# paymentLinkHelper
source: Used for collecting game fees
he: משמש לאיסוף כספי משחק

source: Save Link
he: שמור קישור

source: Only Hub admins can change settings
he: רק מנהלי הוב יכולים לשנות הגדרות

# playerDetailsUpdatedSuccess
source: Player details updated successfully
he: פרטי השחקן עודכנו בהצלחה

# pleaseEnterValidEmail
source: Please enter a valid email
he: נא להזין כתובת אימייל תקינה

# hubInvitationEmailSubject
source: Invitation to join {hubName} on Kattrick
he: הזמנה להצטרף ל-{hubName} ב-Kattrick

# hubInvitationEmailBody
source: Hi! {playerName} invited you to join {hubName} on Kattrick. Click the link to join: {link} Or use code: {code}
he: היי! {playerName} הזמין אותך להצטרף ל-{hubName} ב-Kattrick. לחץ על הקישור להצטרפות: {link} או השתמש בקוד: {code}

source: Email client opened
he: אפליקציית האימייל נפתחה

source: Link copied to clipboard
he: הקישור הועתק ללוח

# editManualPlayerTitle
source: Edit Player
he: עריכת שחקן

# editManualPlayerSubtitle
source: Update details for manual player
he: עדכון פרטים לשחקן ידני

# fullNameRequired
source: Full Name *
he: שם מלא *

# pleaseEnterName
source: Please enter a name
he: נא להזין שם

# emailForInvitationLabel
source: Email (for invitation)
he: אימייל (להזמנה)

source: Invalid email address
he: כתובת אימייל לא תקינה

# phoneNumberLabel
source: Phone Number
he: מספר טלפון

# cityLabel
source: City
he: עיר

# ratingLabel
source: Rating (0-10)
he: דירוג (0-10)

# ratingRangeError
source: Rating must be between 0 and 10
he: הדירוג חייב להיות בין 0 ל-10

# preferredPositionLabel
source: Preferred Position
he: עמדה מועדפת

# sendEmailInvitation
source: Send Invitation via Email
he: שלח הזמנה במייל

source: Save Changes
he: שמור שינויים

# positionGoalkeeper
source: Goalkeeper
he: שוער

# positionDefense
source: Defender
he: הגנה

# positionMidfielder
source: Midfielder
he: קישור

# positionForward
source: Forward
he: התקפה

# yourHubsTitle
source: Your Hubs
he: ההובים שלך

# notificationsTooltip
source: Notifications
he: התראות

# mapTooltip
source: Map
he: מפה

# discoverHubsTooltip
source: Discover Hubs
he: גלה הובים

# backToHomeTooltip
source: Back to Home
he: חזרה לבית

source: Error loading hubs
he: שגיאה בטעינת הובים

# noHubs
source: No hubs found
he: לא נמצאו הובים

# createHubToStart
source: Create a hub to get started!
he: צור הוב כדי להתחיל!

# memberCount
source: {count} members
he: {count} חברים

# hubNotFoundWithInviteCode
source: Hub not found with this invitation code
he: לא נמצא הוב עם קוד הזמנה זה

source: Please login first
he: נא להתחבר תחילה

# hubInvitationsDisabled
source: Invitations are disabled for this hub
he: ההזמנות להוב זה מושבתות

# joinedHubSuccess
source: Successfully joined {hubName}
he: הצטרפת בהצלחה ל-{hubName}

# joinRequestSent
source: Join request sent successfully
he: בקשת הצטרפות נשלחה בהצלחה

# joinHubError
source: Error joining hub: {error}
he: שגיאה בהצטרפות להוב: {error}

# joinHubTitle
source: Join Hub
he: הצטרף להוב

source: Back to Home
he: חזרה לבית

# hubRequiresApproval
source: This hub requires admin approval to join
he: הוב זה דורש אישור מנהל להצטרפות

source: Send Join Request
he: שלח בקשת הצטרפות

# joinHubButton
source: Join Hub
he: הצטרף להוב
